In [1]:
import pandas as pd

Creating a DataFrame

In [3]:
data = {
    'Name': ['Alex', 'Sara', 'John'],
    'Age': [25, 19, 33],
    'Department': ['Data Engineer', 'Analytics', 'IT']
}

In [4]:
df = pd.DataFrame(data)

Viewing Data

In [5]:
print(df)

   Name  Age     Department
0  Alex   25  Data Engineer
1  Sara   19      Analytics
2  John   33             IT

In [6]:
print('First two rows: \n',df.head(2))

First two rows:
    Name  Age     Department
0  Alex   25  Data Engineer
1  Sara   19      Analytics

DataFrame Operations

In [7]:
print('Average Age: ', df['Age'].mean())

Average Age:  25.666666666666668

In [8]:
df['Age'] = df['Age']+1 # Updating column
print('Updated DataFrame: \n', df)

Updated DataFrame:
    Name  Age     Department
0  Alex   26  Data Engineer
1  Sara   20      Analytics
2  John   34             IT

Filtering Data

In [10]:
young_employees = df[df['Age'] < 28]
print('Young Employee: \n',young_employees)

Young Employee:
    Name  Age     Department
0  Alex   26  Data Engineer
1  Sara   20      Analytics

### Create a DataFrame with at least 4 columns (like name, age, salary, and department) and 5 rows.

In [11]:
data = {
    'Name': ['Mani', 'Yash', 'Sid', 'Raj', 'Karan'],
    'Age': [22, 24, 28, 26, 30],
    'Salary': [12000, 28000, 14000, 5000, 30000],
    'Department': ['IT', 'Analyst', 'IT', 'Clerk', 'Data Eng']
}

In [12]:
df = pd.DataFrame(data)

In [13]:
df.head()

    Name  Age  Salary Department
0   Mani   22   12000         IT
1   Yash   24   28000    Analyst
2    Sid   28   14000         IT
3    Raj   26    5000      Clerk
4  Karan   30   30000   Data Eng

### Add a new column called Bonus with random values.

In [14]:
df['Bonus'] = [15, 12, 10, 5, 20]

In [15]:
df.head()

    Name  Age  Salary Department  Bonus
0   Mani   22   12000         IT     15
1   Yash   24   28000    Analyst     12
2    Sid   28   14000         IT     10
3    Raj   26    5000      Clerk      5
4  Karan   30   30000   Data Eng     20

### Filter out employees with a salary above a certain threshold.

In [16]:
df['Salary'].mean()

np.float64(17800.0)

In [18]:
print("Employee's salary below average: \n", df[df['Salary'] < 17800])

Employee's salary below average:
    Name  Age  Salary Department  Bonus
0  Mani   22   12000         IT     15
2   Sid   28   14000         IT     10
3   Raj   26    5000      Clerk      5

In [19]:
### Save your DataFrame to a CSV file using df.to_csv('output.csv', index=False).

In [20]:
df.to_csv('output.csv', index=False)